HCHCHC99/WS_L_re/ws_L_v.inmop_curloop_re/HC32F460_DDL_Rev3.3.0/projects/ev_hc32f460_lqfp100_v2/template/source/main.c
            cur[7] = g_speed40_running  ? (int32_t)(g_speed40_iq_ref_ma) /* mode40: iq 参考 (mA -> A) */
                    : g_drun29_running ? (int32_t)(g_drun29_iq_ref_ma)  /* mode29: iq 参考 (mA -> A) */
                    : g_drun41_running ? (int32_t)(g_drun41_iq_ref_ma)  /* mode41: iq 参考 (mA -> A) */
                    : g_dci_running    ? (int32_t)(g_dci_iq_ref_ma)    /* mode28: iq 参考 (mA -> A) */
                                       : (int32_t)(g_zizeng_volt_v * 1000.0f); /* mode30: 电压幅值 (mV -> V) */
            cur[8] = (g_drun29_running || g_drun41_running || g_dci_running)
                                   ? (int32_t)(g_foc_vd * 1000.0f)     /* mode28/29/41: 输出 vd (V) */
                                   : (int32_t)sqrtf(g_foc_iq_ma * g_foc_iq_ma
                                      + g_foc_id_ma * g_foc_id_ma);    /* 控制系合成 (mA -> A) */
            cur[9] = (g_drun29_running || g_drun41_running || g_dci_running)
                                   ? (int32_t)(g_foc_vq * 1000.0f)     /* mode28/29/41: 输出 vq (V) */
                                   : (int32_t)(g_zizeng_theta_rad * 1000.0f); /* mode30: 控制系角度 (mrad -> rad) */

            cur[10] = g_drun29_running ? (int32_t)(g_drun29_iq_mean_ma) /* mode29: iq 3s均值 (mA -> A) */
                     : g_drun41_running ? (int32_t)(g_drun41_iq_mean_ma) /* mode41: iq 3s均值 (mA -> A) */
                     : g_dci_running    ? (int32_t)(g_dci_iq_mean_ma)   /* mode28: iq 3s均值 (mA -> A) */
                                        : (int32_t)(g_foc_iab_mag * 1000.0f); /* 静止系幅值 (mA -> A) */
#if ZIZENG_VOLT_ON_Q_AXIS
            /* P = 1.5*vq*iq，iq_ma 已是 mA，结果直接为 mA -> 显示 A */
            cur[11] = (int32_t)(1.5f * g_zizeng_volt_v
                                * (float)g_foc_iq_ma / FOC_VBUS_V);
#else
            /* P = 1.5*vd*id */
            cur[11] = (int32_t)(1.5f * g_zizeng_volt_v
                                * (float)g_foc_id_ma / FOC_VBUS_V);
#endif
            if (g_drun29_running) {
                cur[11] = (int32_t)(g_drun29_id_mean_ma); /* mode29: id 3s均值 (mA -> A) */
            } else if (g_drun41_running) {
                cur[11] = (int32_t)(g_drun41_id_mean_ma); /* mode41: id 3s均值 (mA -> A) */
            } else if (g_dci_running) {
                cur[11] = (int32_t)(g_dci_id_mean_ma); /* mode28: id 3s均值 (mA -> A) */
            }
            cur[12] = (int32_t)(g_iqpi_iq_ref_ramp_ma); /* mode31 iq 参考(斜坡后), mA -> A */
            cur[13] = g_olf_diff_deg * 1000;          /* mode26 负载角 delta (mdeg -> deg) */
            cur[14] = (int32_t)(g_speed40_speed_target_rpm * 1000.0f); /* mode40 目标转速 (mrpm -> rpm) */
            cur[15] = (int32_t)(g_speed40_speed_filt_rpm * 1000.0f);   /* mode40 实际转速 (mrpm -> rpm) */
            cur[16] = g_drun41_running
                            ? (int32_t)(g_drun41_iq_filt_ma)           /* mode41: filtered iq (mA -> A) */
                            : g_drun29_running
                            ? (int32_t)(g_drun29_iq_filt_ma)           /* mode29: filtered iq (mA -> A) */
                            : g_speed40_running
                            ? (int32_t)(g_speed40_iq_filt_ma)          /* mode40: filtered iq (mA -> A) */
                            : 0;
            Usart3_Vofa_SendScaled(cur, 17, USART3_VOFA_SCALE_MILLI);
            }
        }
#endif
    }
}

/*=============================================================================
 * 噪声排查：恢复全部被暂停模块
 *=============================================================================*/
static void Noisy_RestoreAll(void)
{
    if (s_noisy_adc_disabled) {
        I_StartSampling();
        s_noisy_adc_disabled = false;
    }

    if (s_noisy_pwm_disabled) {
        /* I_Calibrate 之后的 mode0 基线是互补 PWM 50/50/50 零矢量。
         * 这里恢复到同一状态；SetFocMode 内部会重启计数器。 */
        TMR4_PWM_SetFocMode(FOC_DEADTIME_NS);
        TMR4_PWM_StartOutput();
        TMR4_PWM_SetDuty3Phase(50.0f, 50.0f, 50.0f);
        s_noisy_pwm_disabled = false;
    }

    if (s_noisy_timer0_disabled) {
        TMR0_Unit2_Start(TMR0_CHANNEL_A_2);
        TMR0_Unit2_Start(TMR0_CHANNEL_B_2);
        TMR0_Unit1_Start(TMR0_CHANNEL_B_1);
        TMR0_Unit1_Start(TMR0_CHANNEL_A_1);
        s_noisy_timer0_disabled = false;
    }

    if (s_noisy_systick_disabled) {
        uint32_t ctrl = SysTick->CTRL;
        ctrl |= SysTick_CTRL_TICKINT_Msk | SysTick_CTRL_ENABLE_Msk;
        SysTick->VAL = 0UL;
        SysTick->CTRL = ctrl;
        s_noisy_systick_disabled = false;
    }

    if (s_noisy_timer6_disabled) {
        Timer6_Timebase_Start();
        s_noisy_timer6_disabled = false;
    }

    if (s_noisy_vofa_disabled) {
        Usart3_Vofa_Init(NULL);    /* NULL 使用默认 115200 配置 */
        s_noisy_vofa_disabled = false;
    }

    s_noisy_encoder_enabled = 1U;
    s_noisy_foc_obs_enabled = 1U;
}

/*=============================================================================
 * 噪声排查：Watch 修改 check_noisy_mode 后逐项隔离可疑模块
 *=============================================================================*/
static void Noisy_Apply(int requested, int *prev_comm_mode)
{
    if ((requested < NOISY_MODE_FULL) || (requested > NOISY_MODE_FOC_OBS)) {
        requested = NOISY_MODE_FULL;
        check_noisy_mode = NOISY_MODE_FULL;
    }

    /* 每次切换都先回到安全 mode0，再做恢复/隔离，避免恢复 ADC 时仍处在
     * mode24/29/40 等电流控制模式。 */
    comm_mode = COMM_RUNNER_STOP;
    *prev_comm_mode = COMM_RUNNER_STOP;
    CommRunner_SetMode((comm_runner_mode_t)COMM_RUNNER_STOP);
    Noisy_RestoreAll();

    switch (requested) {
    case NOISY_MODE_ADC:
        I_StopSampling();
        s_noisy_adc_disabled = true;
        break;

    case NOISY_MODE_PWM:
        /* 只禁 OC 输出，不停 TMR4_3；因此 ADC 的 VALLEY 比较事件仍在。 */
        TMR4_PWM_SetChannelMode(TMR4_CHANNEL_U, TMR4_MODE_OFF, 0.0f);
        TMR4_PWM_SetChannelMode(TMR4_CHANNEL_V, TMR4_MODE_OFF, 0.0f);
        TMR4_PWM_SetChannelMode(TMR4_CHANNEL_W, TMR4_MODE_OFF, 0.0f);
        s_noisy_pwm_disabled = true;
        break;

    case NOISY_MODE_TIMER0:
        TMR0_Unit2_Stop(TMR0_CHANNEL_B_2);
        TMR0_Unit2_Stop(TMR0_CHANNEL_A_2);
        TMR0_Unit1_Stop(TMR0_CHANNEL_B_1);
        TMR0_Unit1_Stop(TMR0_CHANNEL_A_1);
        s_noisy_timer0_disabled = true;
        break;

    case NOISY_MODE_SYSTICK:
        SysTick->CTRL &= ~SysTick_CTRL_ENABLE_Msk;
        s_noisy_systick_disabled = true;
        break;

    case NOISY_MODE_TIMER6:
        Timer6_Timebase_Stop();
        s_noisy_timer6_disabled = true;
        break;

    case NOISY_MODE_VOFA:
        Usart3_Vofa_DeInit();
        s_noisy_vofa_disabled = true;
        break;

    case NOISY_MODE_ENCODER:
        s_noisy_encoder_enabled = 0U;
        break;

    case NOISY_MODE_FOC_OBS:
        s_noisy_foc_obs_enabled = 0U;
        break;

    case NOISY_MODE_FULL:
    default:
        break;
    }

    s_noisy_applied = requested;
    MAIN_DBG("[NOISY] mode=%d applied", requested);
}
